content/posts/fu2020.md
+++
title = "fu2020 | A Dual Quaternion-Based Approach for Coordinate Calibration of Dual Robots in Collaborative Motion"
author = ["João Gutemberg Farias"]
draft = false
+++

Interesting article about coordinate calibration of [dual robots]({{< relref "dual_robots" >}}) using dual quaternions. The problem itself is very interesting, we have two robot coordinates system, one camera coordinate system and one coordinate system relative to the object being held. So in order to relate all this coordinates systems and assure that they are calibrated, the authors calibrate a hand-eye, a robot-robot and a tool-flange transformations.

The article concludes that the DQ methodology offers higher calibration accurary when compared to existing methods.


## Info {#info}

Coordinate calibration accuracy is a prerequisite for the achievement of collaborative motion of dual robots, and visual positioning. In the case of AXB=YCZ, the associated hand-eye (X), robot-robot (Y), and tool-flange (Z) coordinate relationships need to be determined in order to provide accurate data for dual-robot manipulation. The classical independent estimations and separable solving of rotational and translational components, inevitably induce certain levels of inaccuracy and inconsistency. To this end, the work presented herein describes an efficient approach based on dual quaternion (DQ), to the calibration of the hand-eye (X), robot-robot (Y), tool-flange (Z) transformations, corresponding to the dual-robot collaborative motion. After establishing a closedform kinematic equation for dual robots in DQ form, the calibration process is divided into two steps: 1) the hand-eye transformation (X) calibration is performed by letting the one robot with the visual sensor move freely, while keeping the other robot with the end-tool in a fixed configuration, thereby allowing the calibration result to be obtained by solving the DQ-based linear equations with the SVD algorithm; 2) the simultaneous calibration of robot-robot (Y) and tool-flange (Z) is transformed into a DQ-based equation, and the results are obtained in a similar way. A simulation analysis is carried out, accounting for the presence of noise levels and different data pairs, while calibration experiments are also conducted to verify the accuracy and efficacy of the proposed method.


## Notes {#notes}


### Resumo {#resumo}

Interesting article about coordinate calibration of [dual robots]({{< relref "dual_robots" >}}) using dual quaternions. The problem itself is very interesting, we have two robot coordinates system, one camera coordinate system and one coordinate system relative to the object being held. So in order to relate all this coordinates systems and assure that they are calibrated, the authors calibrate a hand-eye, a robot-robot and a tool-flange transformations.

The article concludes that the DQ methodology offers higher calibration accurary when compared to existing methods.
